Public Attributes | List of all members
API_UnitType Struct Reference
Old Listing
Description of an unit. More...
#include <APIdefs_ListData.h>
 Public Attributes
API_ListData_Head  | head
Contains the header information, including type, setIndex and index.
char  | code [API_DBCodeLen]
Unit code.
char  | name [API_DBCodeLen]
Detailed Description
Description of an unit.
Remarks
This structure is used when you retrieve or search for an unit in the listing database. See the ACAPI_OldListing_Get and ACAPI_OldListing_Search functions.
Member Data Documentation
◆ code
 API_UnitType::code
Unit code.
◆ head
 API_UnitType::head
Contains the header information, including type, setIndex and index.
Unit name.
◆ name
 char API_UnitType::name[API_DBCodeLen]